## 📋 OpenTofu Plan

**Environment:** `dev`
**Directory:** `./environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.azurerm_management_group.tenant_root: Reading...
data.azurerm_management_group.tenant_root: Read complete after 0s [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_management_group_policy_assignment.drive_deny_delete will be created
  + resource "azurerm_management_group_policy_assignment" "drive_deny_delete" {
      + description          = "Prevents deletion of any resources under drive management group"
      + display_name         = "Deny Delete - Drive"
      + enforce              = true
      + id                   = (known after apply)
      + management_group_id  = (known after apply)
      + metadata             = (known after apply)
      + name                 = "deny-del-drive"
      + policy_definition_id = (known after apply)
    }

  # module.drive_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "drive"
      + id                         = (known after apply)
      + name                       = "mg-drive-prd-glb-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

  # module.policy_deny_delete.azurerm_policy_definition.deny_delete will be created
  + resource "azurerm_policy_definition" "deny_delete" {
      + description         = "This policy denies all delete operations on resources for maximum protection."
      + display_name        = "Deny Delete Operations - Deny Delete"
      + id                  = (known after apply)
      + management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + metadata            = jsonencode(
            {
              + category = "Protection"
              + version  = "1.0.0"
            }
        )
      + mode                = "All"
      + name                = "deny-delete-deny-delete"
      + policy_rule         = jsonencode(
            {
              + if   = {
                  + allOf = [
                      + {
                          + exists = "true"
                          + field  = "type"
                        },
                    ]
                }
              + then = {
                  + details = {
                      + actionNames = [
                          + "delete",
                        ]
                    }
                  + effect  = "denyAction"
                }
            }
        )
      + policy_type         = "Custom"
      + role_definition_ids = (known after apply)
    }

  # module.sandbox_management_group.azurerm_management_group.this will be created
  + resource "azurerm_management_group" "this" {
      + display_name               = "sandbox"
      + id                         = (known after apply)
      + name                       = "mg-sandbox-dev-glb-01"
      + parent_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"
      + subscription_ids           = (known after apply)
      + tenant_scoped_id           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + drive_management_group          = {
      + display_name = "drive"
      + id           = (known after apply)
      + name         = "mg-drive-prd-glb-01"
    }
  + environment_info                = {
      + environment = "dev"
      + tenant_id   = "90d27970-b92c-43dc-9935-1ed557d8e20e"
    }
  + sandbox_management_group        = {
      + display_name = "sandbox"
      + id           = (known after apply)
      + name         = "mg-sandbox-dev-glb-01"
    }
  + tenant_root_management_group_id = "/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit b4d2eedf8f775113ef8be27b02086054dec164c8*